Ran Apply for dir: `.` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
running "terragrunt apply -no-color" in "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/13/default": exit status 1: running "terragrunt apply -no-color" in "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/13/default": 
08:28:41.376 STDOUT terraform: random_pet.bucket_name: Refreshing state... [id=unduly-eminent-primate]
08:28:41.597 STDOUT terraform: aws_s3_bucket.test_bucket: Refreshing state... [id=atlantis-terragrunt-test-unduly-eminent-primate]
08:28:42.233 STDOUT terraform: Terraform used the selected providers to generate the following execution
08:28:42.233 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
08:28:42.233 STDOUT terraform: -/+ destroy and then create replacement
08:28:42.233 STDOUT terraform: Terraform will perform the following actions:
08:28:42.233 STDOUT terraform:   # aws_s3_bucket.test_bucket must be replaced
08:28:42.233 STDOUT terraform: -/+ resource "aws_s3_bucket" "test_bucket" {
08:28:42.233 STDOUT terraform:       + acceleration_status         = (known after apply)
08:28:42.233 STDOUT terraform:       + acl                         = (known after apply)
08:28:42.233 STDOUT terraform:       ~ arn                         = "arn:aws:s3:::atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply)
08:28:42.233 STDOUT terraform:       ~ bucket                      = "atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply) # forces replacement
08:28:42.233 STDOUT terraform:       ~ bucket_domain_name          = "atlantis-terragrunt-test-unduly-eminent-primate.s3.amazonaws.com" -> (known after apply)
08:28:42.233 STDOUT terraform:       + bucket_prefix               = (known after apply)
08:28:42.233 STDOUT terraform:       ~ bucket_regional_domain_name = "atlantis-terragrunt-test-unduly-eminent-primate.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
08:28:42.233 STDOUT terraform:       ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
08:28:42.233 STDOUT terraform:       ~ id                          = "atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply)
08:28:42.233 STDOUT terraform:       ~ object_lock_enabled         = false -> (known after apply)
08:28:42.233 STDOUT terraform:       + policy                      = (known after apply)
08:28:42.233 STDOUT terraform:       ~ region                      = "ap-southeast-1" -> (known after apply)
08:28:42.233 STDOUT terraform:       ~ request_payer               = "BucketOwner" -> (known after apply)
08:28:42.233 STDOUT terraform:       - tags                        = {} -> null
08:28:42.233 STDOUT terraform:       ~ tags_all                    = {} -> (known after apply)
08:28:42.233 STDOUT terraform:       + website_domain              = (known after apply)
08:28:42.233 STDOUT terraform:       + website_endpoint            = (known after apply)
08:28:42.234 STDOUT terraform:         # (1 unchanged attribute hidden)
08:28:42.234 STDOUT terraform:       ~ cors_rule (known after apply)
08:28:42.234 STDOUT terraform:       ~ grant (known after apply)
08:28:42.234 STDOUT terraform:       - grant {
08:28:42.234 STDOUT terraform:           - id          = "9f83ffd5bd78abb53e8b9de59f80f4efce23bffeeef98c1cab7e0b3e28cabbd4" -> null
08:28:42.234 STDOUT terraform:           - permissions = [
08:28:42.234 STDOUT terraform:               - "FULL_CONTROL",
08:28:42.234 STDOUT terraform:             ] -> null
08:28:42.234 STDOUT terraform:           - type        = "CanonicalUser" -> null
08:28:42.234 STDOUT terraform:             # (1 unchanged attribute hidden)
08:28:42.234 STDOUT terraform:         }
08:28:42.234 STDOUT terraform:       ~ lifecycle_rule (known after apply)
08:28:42.234 STDOUT terraform:       ~ logging (known after apply)
08:28:42.234 STDOUT terraform:       ~ object_lock_configuration (known after apply)
08:28:42.234 STDOUT terraform:       ~ replication_configuration (known after apply)
08:28:42.234 STDOUT terraform:       ~ server_side_encryption_configuration (known after apply)
08:28:42.234 STDOUT terraform:       - server_side_encryption_configuration {
08:28:42.234 STDOUT terraform:           - rule {
08:28:42.234 STDOUT terraform:               - bucket_key_enabled = false -> null
08:28:42.234 STDOUT terraform:               - apply_server_side_encryption_by_default {
08:28:42.234 STDOUT terraform:                   - sse_algorithm     = "AES256" -> null
08:28:42.234 STDOUT terraform:                     # (1 unchanged attribute hidden)
08:28:42.234 STDOUT terraform:                 }
08:28:42.234 STDOUT terraform:             }
08:28:42.234 STDOUT terraform:         }
08:28:42.234 STDOUT terraform:       ~ versioning (known after apply)
08:28:42.234 STDOUT terraform:       - versioning {
08:28:42.234 STDOUT terraform:           - enabled    = false -> null
08:28:42.234 STDOUT terraform:           - mfa_delete = false -> null
08:28:42.234 STDOUT terraform:         }
08:28:42.234 STDOUT terraform:       ~ website (known after apply)
08:28:42.234 STDOUT terraform:     }
08:28:42.234 STDOUT terraform:   # random_pet.bucket_name must be replaced
08:28:42.234 STDOUT terraform: -/+ resource "random_pet" "bucket_name" {
08:28:42.234 STDOUT terraform:       ~ id        = "unduly-eminent-primate" -> (known after apply)
08:28:42.234 STDOUT terraform:       ~ length    = 3 -> 5 # forces replacement
08:28:42.234 STDOUT terraform:         # (1 unchanged attribute hidden)
08:28:42.234 STDOUT terraform:     }
08:28:42.234 STDOUT terraform: Plan: 2 to add, 0 to change, 2 to destroy.
08:28:42.234 STDOUT terraform: Do you want to perform these actions?
08:28:42.234 STDOUT terraform:   Terraform will perform the actions described above.
08:28:42.234 STDOUT terraform:   Only 'yes' will be accepted to approve.
08:28:42.234 STDOUT terraform:   Enter a value: 
08:34:48.883 INFO   Terminated signal received. Gracefully shutting down... (it can take up to 30s)
08:34:48.883 STDOUT terraform: Error: error asking for approval: context canceled
08:34:48.883 STDOUT terraform: Interrupt received.
08:34:48.883 STDOUT terraform: Please wait for Terraform to exit or data loss may occur.
08:34:48.883 STDOUT terraform: Gracefully shutting down...
08:34:48.892 INFO   Second Child Exited signal received, force shutting down...



```
</details>